# 占位运算符是用来在字符串中插入变量的，占位符的格式是：
# %s -> 字符串
# %d -> 整数
# %f -> 浮点数
# %% -> 百分号字符,常用于转义
# %r -> 原始字符串（repr()）
# %x -> 十六进制（小写）
# %X -> 十六进制（大写）
# %o -> 八进制
# %b -> 二进制
# %c -> 字符
# %i -> 整数（和%d一样，但是%d更常用）
# %e -> 科学计数法（小写）
# %E -> 科学计数法（大写）
# %g -> 根据数值大小自动选择%f或%e
# %G -> 根据数值大小自动选择%f或%E
# 使用占位符时，使用格式为：
print("%s" % "hello world")
# 这样写是错误的，因为逗号将"%s"和"%d"分隔成了两个独立的部分，导致语法错误。
# print("%s", "%d" % ("hello world", 123))
print("字符串格式为：%s 整数格式为：%d" % ("hello world", 123))
# 可以在符号后面加上宽度，比如：%10s，表示宽度为10，如果字符串长度不足10，则前面补空格
print("字符串格式为：%20s 整数格式为：%d" % ("hello world", 123))
# 还可以使用%-20s，表示宽度为20，如果字符串长度不足20，则前面补空格，并且右对齐
print("字符串格式为：%-20s 整数格式为：%d" % ("hello world", 123))
# 空格部分可以使用0来填充，比如：%020d，表示宽度为20，如果整数长度不足20，则前面补0，注意字符串不起作用
# 注意：%020s 对字符串不起作用，因为字符串不会用0填充，而是默认用空格填充。
print("字符串格式为：%020s 整数格式为：%020d" % ("hello world", 123))
# 如果是浮点数，还可以控制精度
print("浮点数格式为：%.2f" % 3.1415926)

# f格式化
name = "xiaozhiqiang"
age = 18
print(f"我的名字是{name},我的年龄是{age}")
