# 十进制表示，逢十进一
a = 8
# 二进制表示，逢二进一,用0b开头表示二进制
# 十进制 8 转换成二进制
# 8 / 2 = 4 余0
# 4 / 2 = 2 余0
# 2 / 2 = 1 余0
b = 0b1000
print("a是%d,b是%d" % (a, b))
# 二进制 0b111001 转换成十进制
# 1 * 2^0 + 0 * 2^1 + 0 * 2^2 + 1 * 2^3 + 1 * 2^4 + 1 * 2^5 =1+0+0+8+16+32=57
print(0b111001)

# 八进制表示，逢八进一，用0o开头表示八进制
c = 0o76
print("c是%d" % c)

# 十六进制表示，逢16进一，用0x开头表示十六进制
d = 0x3a
print("d是%d" % d)

# bin函数，可以将参数自动转换成二进制数
d = bin(8)
print(d)
# oct函数，可以将参数自动转换为八进制数
e = oct(8)
print(e)
# hex函数，可以将参数自动转换为十六进制数
f = hex(8)
print(f)
# int函数，可以将参数自动转换为十进制数
g = int(0b1000)
print(g)
